src/Documents/ФинансовыйПлан/ФинансовыйПлан.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ФинансовыйПлан</name>
  <registerRecords>AccumulationRegister.ПланируемаяОплатаЗаявок</registerRecords>
  <registerRecords>AccumulationRegister.ПланируемыеДвижения</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>РучнаяКорректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Планирование</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетОрганизации</name>
      <type>
        <types>CatalogRef.БанковскиеСчета</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДДС</name>
      <type>
        <types>CatalogRef.СтатьиДДС</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетКонтрагента</name>
      <type>
        <types>CatalogRef.БанковскиеСчета</types>
      </type>
    </attributes>
    <attributes>
      <name>НазначениеПлатежа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>800</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВалютаЗаявки</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВалютнаяСумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КатегорияОперации</name>
      <type>
        <types>CatalogRef.КатегорииОпераций</types>
      </type>
    </attributes>
    <attributes>
      <name>Процент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КурсОплатыФиксированный</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтменаПлатежа</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОплатаВыполнена</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>АвторСтроки</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗаявки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>GUIDСтрокиФинансовогоПлана</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>IDЗаявки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаявкаВзятаВРаботу</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УправленческийУчетЗаявок</name>
    <attributes>
      <name>GUIDСтрокиФинансовогоПлана</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.РеквизитыУправленческогоУчета</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипРеквизита</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗапретРедактирования</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Необязательный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидПараметра</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.РеквизитыУправленческогоУчета</types>
      </type>
    </attributes>
    <attributes>
      <name>Формула</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ФинансовыйПлан/Forms/ФормаИмпорта/Module.bsl
&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	Для Каждого СтрокаТЗ Из ТаблицаПлатежей Цикл
		СтрокаТЗ.Флаг = Истина;
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	Для Каждого СтрокаТЗ Из ТаблицаПлатежей Цикл
		СтрокаТЗ.Флаг = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СкопироватьСтрокиНаСервере()
	
	Для Каждого СтрокаТЗ Из ТаблицаПлатежей Цикл
		
		
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьСтроки(Команда)
	
	ПоказатьВопрос(Новый ОписаниеОповещения("СкопироватьСтрокиЗавершение", ЭтотОбъект), "Скопировать строки в текущий финансовый план?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьСтрокиЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		СкопироватьСтрокиНаСервере();
		
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьТаблицуПлатежейИзДокумента(Флаг = Ложь)
	
	ТаблицаПлатежей.Очистить();
	
	Если ЗначениеЗаполнено(ФинансовыйПлан) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ФинансовыйПланПланирование.НомерСтроки КАК НомерСтроки,
		|	ФинансовыйПланПланирование.Организация КАК Организация,
		|	ФинансовыйПланПланирование.СчетОрганизации КАК СчетОрганизации,
		|	ФинансовыйПланПланирование.Контрагент КАК Контрагент,
		|	ФинансовыйПланПланирование.СчетКонтрагента КАК СчетКонтрагента,
		|	ФинансовыйПланПланирование.НазначениеПлатежа КАК НазначениеПлатежа,
		|	ФинансовыйПланПланирование.Сумма КАК Сумма,
		|	ФинансовыйПланПланирование.Валюта КАК Валюта,
		|	ИСТИНА КАК Флаг,
		|	ФинансовыйПланПланирование.Комментарий КАК Комментарий,
		|	ФинансовыйПланПланирование.СтатьяДДС КАК СтатьяДДС,
		|	ФинансовыйПланПланирование.ВалютнаяСумма КАК ВалютнаяСумма,
		|	ФинансовыйПланПланирование.АвторСтроки КАК АвторСтроки
		|ИЗ
		|	Документ.ФинансовыйПлан.Планирование КАК ФинансовыйПланПланирование
		|ГДЕ
		|	ФинансовыйПланПланирование.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		
		Запрос.УстановитьПараметр("Ссылка", ФинансовыйПлан);
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			НоваяСтрока = ТаблицаПлатежей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
			НоваяСтрока.Флаг = Флаг;
			
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокумент(УдалитьИсходныеСтроки = Ложь, ОчиститьИсходныйДокумент = Ложь) Экспорт
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ФинансовыйПлан", ФинансовыйПлан);
	
	МассивСтрок = Новый Массив;
	
	Для Каждого СтрокаТЗ Из ТаблицаПлатежей Цикл
		
		Если НЕ СтрокаТЗ.Флаг Тогда
			Продолжить;
		КонецЕсли;
		
		МассивСтрок.Добавить(СтрокаТЗ.НомерСтроки);
		
	КонецЦикла;
	
	СтруктураВозврата.Вставить("МассивСтрок", МассивСтрок);
	СтруктураВозврата.Вставить("УдалитьИсходныеСтроки", УдалитьИсходныеСтроки);
	СтруктураВозврата.Вставить("ОчиститьИсходныйДокумент", ОчиститьИсходныйДокумент);
	
	Закрыть(СтруктураВозврата);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьФинансовыйПлан(Команда)
	
	ТекущиеДанные = Элементы.СписокФинансовыхПланов.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		
		ФинансовыйПлан = ТекущиеДанные.Ссылка;
		Элементы.ГруппаСписокФинансовыхПланов.Видимость = Ложь;
		Элементы.ГруппаТаблицаПлатежей.Видимость = Истина;
		ЗаполнитьТаблицуПлатежейИзДокумента();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.ГруппаСписокФинансовыхПланов.Видимость = Истина;
	Элементы.ГруппаТаблицаПлатежей.Видимость = Ложь;
	
	Если Параметры.Свойство("ТекущийДокумент") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокФинансовыхПланов, "ТекущийДокумент", Параметры.ТекущийДокумент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокФинансовыхПлановВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	// ВыбратьФинансовыйПлан(Неопределено);
	ОбъединитьЦеликом(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ОбъединитьЦеликом(Команда)
	
	ТекущиеДанные = Элементы.СписокФинансовыхПланов.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		//ПоказатьВопрос(Новый ОписаниеОповещения("ОбъединитьЦеликомЗавершение", ЭтотОбъект, Новый Структура("ТекущиеДанные", ТекущиеДанные)), "Объединить со всеми строками плана " + ТекущиеДанные.Ссылка + "?", РежимДиалогаВопрос.ДаНет);
		
		СписокКнопок = Новый СписокЗначений;
		СписокКнопок.Добавить("Скопировать", "Скопировать");
		СписокКнопок.Добавить("Перенести", "Перенести");
		СписокКнопок.Добавить("Отмена", "Отмена");
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ОбъединитьЦеликомЗавершение", ЭтотОбъект, Новый Структура("ТекущиеДанные", ТекущиеДанные)), "Объединить со всеми строками плана " + ТекущиеДанные.Ссылка + "?", СписокКнопок);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъединитьЦеликомЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт

	Если РезультатВопроса = "Отмена" Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = ДополнительныеПараметры.ТекущиеДанные;
	ФинансовыйПлан = ТекущиеДанные.Ссылка;

	Если РезультатВопроса = "Скопировать" Тогда
		
		ЗаполнитьТаблицуПлатежейИзДокумента(Истина);
		ПеренестиВДокумент();
		
	ИначеЕсли РезультатВопроса = "Перенести" Тогда
		
		ЗаполнитьТаблицуПлатежейИзДокумента(Истина);
		ПеренестиВДокумент(Истина, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокументСтроки(Команда)
	
	СписокКнопок = Новый СписокЗначений;
	СписокКнопок.Добавить("Скопировать", "Скопировать");
	СписокКнопок.Добавить("Перенести", "Перенести");
	СписокКнопок.Добавить("Отмена", "Отмена");
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ПеренестиВДокументСтрокиЗавершение", ЭтотОбъект), "Объединить со строками плана?", СписокКнопок);
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокументСтрокиЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт

	Если РезультатВопроса = "Отмена" Тогда
		Возврат;
	КонецЕсли;
	
	//ТекущиеДанные = ДополнительныеПараметры.ТекущиеДанные;
	//ФинансовыйПлан = ТекущиеДанные.Ссылка;

	Если РезультатВопроса = "Скопировать" Тогда
		
		//ЗаполнитьТаблицуПлатежейИзДокумента(Истина);
		ПеренестиВДокумент();
		
	ИначеЕсли РезультатВопроса = "Перенести" Тогда
		
		//ЗаполнитьТаблицуПлатежейИзДокумента(Истина);
		ПеренестиВДокумент(Истина);
		
	КонецЕсли;
	
КонецПроцедуры
